<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2

In [44]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python

In [32]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

NameError: name 'DBNAME' is not defined

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [3]:
# Используем агрегатную функцию COUNT
query_3_1 = f'''
        select count(id)
           FROM public.vacancies
'''

In [4]:
# результат запроса
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_29464\1114379196.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [37]:
# Используем агрегатную функцию COUNT
query_3_2 = f'''
        select count(id)
           FROM public.EMPLOYERS
'''

In [38]:
# результат запроса
df = pd.read_sql_query(query_3_2, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_11828\3062646138.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [39]:
# Используем агрегатную функцию COUNT
query_3_3 = f'''
        select count(id)
           FROM public.AREAS
'''

In [40]:
# результат запроса
df = pd.read_sql_query(query_3_3, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_11828\928149064.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [41]:
# Используем агрегатную функцию COUNT
query_3_4 = f'''
        select count(id)
           FROM public.INDUSTRIES
'''

In [42]:
# результат запроса
df = pd.read_sql_query(query_3_4, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_11828\2101691108.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

In [ ]:
# выводы по предварительному анализу данных
В таблицах представлены данные о почти 50 тыс. вакансий от 23,5 тыс работодателей из более 1300 городов и охватывающих почти 300 сфер деятельности.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [47]:
# Используем агрегатную функцию COUNT, сгрупируем по региону, выведем первые 5 результатов
query_4_1 = f'''
        select count(v.id) AS cnt,
        a.name AS area
           FROM public.vacancies v
           JOIN public.AREAS a on v.area_id = a.id
        GROUP BY a.name
        ORDER BY 1 desc
        LIMIT 5
'''

In [48]:
# результат запроса
df = pd.read_sql_query(query_4_1, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_11828\2457173557.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

    cnt             area
0  5333           Москва
1  2851  Санкт-Петербург
2  2112            Минск
3  2006      Новосибирск
4  1892           Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [52]:
# Используем агрегатную функцию COUNT, отсортируем при помощи WHERE поля с з/п
query_4_2 = f'''
        select count(v.id)
           FROM public.vacancies v
           WHERE v.salary_from is not NULL OR v.salary_to is not NULL
'''

In [53]:
# результат запроса
df = pd.read_sql_query(query_4_2, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_11828\970655580.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [68]:
# Используем агрегатную функцию AVG к столбцам с з/п и округлим
query_4_3 = f'''
        select round(AVG(v.salary_from)),
            round(AVG(v.salary_to))
           FROM public.vacancies v
'''

In [69]:
# результат запроса
df = pd.read_sql_query(query_4_3, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_11828\2500607024.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

     round     round
0  71065.0  110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [82]:
# Используем агрегатную функцию COUNT с групировкой по типам раб. графика и трудоустройства. Выведем первые 2.
query_4_4 = f'''
        select count(v.id),
                v.schedule,
                v.employment
           FROM public.vacancies v
           GROUP BY v.schedule, v.employment
           ORDER BY 1 desc
           LIMIT 2
'''

In [83]:
# результат запроса
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_11828\2022935265.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

   count          schedule        employment
0  35367       Полный день  Полная занятость
1   7802  Удаленная работа  Полная занятость

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [88]:
# Используем агрегатную функцию COUNT с групировкой по столбцу с опытом работы
query_4_5 = f'''
        select count(v.id),
                v.experience
           FROM public.vacancies v
           GROUP BY v.experience
           ORDER BY 1 
'''

In [89]:
# результат запроса
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_11828\2316260449.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

   count          experience
0   1337         Более 6 лет
1   7197           Нет опыта
2  14511       От 3 до 6 лет
3  26152  От 1 года до 3 лет

***

In [ ]:
# выводы по детальному анализу вакансий
Наибольшее количество вакансий находится в столицах и крупных городах, так как там сосредоточена наибольшая деловая активность. 
Вилка по з/п составляет в среднем от 70 тыс. до 110 тыс. руб. 
Наибольшее кол-во вакансий по типу трудоустройства и типу занятости это на полный рабочий день с полной занятостью. Следом идет удаленная работа с полной занятостью.
В подавляющем большинстве вакансий требуемый опыт работы составляет от 1 года до трех и от трех до 6 лет.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [91]:
# Используем агрегатную функцию COUNT и сгрупируем по работодателям. Объеденим для этого таблицы вакансий и работодателей
query_5_1 = f'''
        select count(v.id),
        e.name
           FROM public.vacancies v
           JOIN public.EMPLOYERS e on v.employer_id = e.id
        GROUP BY 2
        ORDER BY 1 desc
        LIMIT 5
'''

In [92]:
# результат запроса
df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_11828\3834399874.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

   count           name
0   1933         Яндекс
1    491     Ростелеком
2    444       Тинькофф
3    428           СБЕР
4    331  Газпром нефть

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [95]:
# Объеденим 3 таблицы: регионов, работодателей и вакансий. Оставим те в которых нет вакансий
query_5_2 = f'''
        SELECT 
    a.name as "Название региона",
    COUNT(distinct e.id) as "кол-во работодателей",
    COUNT(distinct v.id) as "кол-во вакансий"
FROM areas a 
LEFT JOIN employers e ON a.id = e.area 
LEFT JOIN vacancies v ON v.area_id = a.id
WHERE v.id is null
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10
'''

In [96]:
# результат запроса
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_11828\2250345976.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

        Название региона  кол-во работодателей  кол-во вакансий
0                 Россия                   410                0
1              Казахстан                   207                0
2     Московская область                    75                0
3     Краснодарский край                    19                0
4               Беларусь                    18                0
5     Ростовская область                    18                0
6            Азербайджан                    17                0
7  Нижегородская область                    16                0
8   Республика Татарстан                    16                0
9             Узбекистан                    15                0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [106]:
# Посчитаем кол-во уникальных записей регионов для каждого работодателя
query_5_3 = f'''
        SELECT 
    e.name as "Работодатель",
    COUNT(distinct v.area_id) as "кол-во регионов"
FROM employers e 
JOIN vacancies v ON e.id = v.employer_id
GROUP BY 1
ORDER BY 2 DESC
LIMIT 5
'''

In [107]:
# результат запроса
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_11828\201667002.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

             Работодатель  кол-во регионов
0                  Яндекс              181
1              Ростелеком              152
2              Спецремонт              116
3  Поляков Денис Иванович               88
4               ООО ЕФИН                71

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [114]:
# В объедененной таблице оставим только те у которых нет сферы деятельности. Для этого используем метод объеденения LEFT JOIN
query_5_4 = f'''
        SELECT 
    COUNT(e.id) as "кол-во работодателей"
FROM employers e 
LEFT JOIN EMPLOYERS_INDUSTRIES i ON e.id = i.employer_id
WHERE i.industry_id is NULL
GROUP BY i.industry_id
'''

In [115]:
# результат запроса
df = pd.read_sql_query(query_5_4, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_11828\3493105328.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

   кол-во работодателей
0                  8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [127]:
# Используем агрегатную функцию COUNT в объедененной таблице. Группируем по работодателям, отсортируем с помощью HAVING тех у кого указано 4 сферы деятельности
query_5_5 = f'''
        SELECT 
    e.name as "Работодатель",
    COUNT(i.industry_id)
FROM employers e 
JOIN EMPLOYERS_INDUSTRIES i ON e.id = i.employer_id
GROUP BY 1
HAVING COUNT(i.industry_id) = 4
ORDER BY 1
LIMIT 3
'''

In [128]:
# результат запроса
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_11828\388711819.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

   Работодатель  count
0  101 Интернет      4
1      21vek.by      4
2          2ГИС      4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [135]:
# Используем агрегатную функцию COUNT в объедененной таблице. Сгруппируем по сферам деятельности. Оставим только сферу деятельности - разработка програмного обеспечиния
query_5_6 = f'''
        SELECT 
    COUNT(e.id)
FROM EMPLOYERS_INDUSTRIES i
JOIN employers e ON e.id = i.employer_id
JOIN INDUSTRIES d ON i.industry_id = d.id
WHERE d.name = 'Разработка программного обеспечения'
GROUP BY i.industry_id
'''

In [136]:
# результат запроса
df = pd.read_sql_query(query_5_6, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_11828\821628714.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [25]:
# код для получения списка городов-милионников
import requests
url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'
citys = tuple(pd.read_html(url)[1]['Город'])
display(citys)

('Москва',
 'Санкт-Петербург',
 'Новосибирск',
 'Екатеринбург',
 'Казань',
 'Нижний Новгород',
 'Красноярск',
 'Челябинск',
 'Самара',
 'Уфа',
 'Ростов-на-Дону',
 'Краснодар',
 'Омск',
 'Воронеж',
 'Пермь',
 'Волгоград')

In [89]:
# Объеденим 3 таблицы: вакансии, работодатели и регионы. Оставим только регионы из полученного кортежа городов-миллиоников и работодатель только Яндекс. С помощью UNION ALL добавим total c суммой вакансий 
query_5_7 = f'''
    select
        a.name as region,
        count(*) as vacancies_count
    from
        vacancies as v
        join employers as e on v.employer_id = e.id
        join areas as a on v.area_id = a.id
    group by
        v.area_id, a.name, e.id, e.name
    having
        a.name in {citys} and e.name = 'Яндекс'
    

    union all
    

    select
        'Total',
        sum(x.cnt)
    from
        (
        select
            count(*) as cnt
        from
            vacancies as v
            join employers as e on v.employer_id = e.id
            join areas as a on v.area_id = a.id
        group by
            v.area_id, a.name, e.id, e.name
        having
            a.name in {citys} and e.name = 'Яндекс'
        ) as x
        

    order by 2
    '''

In [90]:
# результат запроса
df = pd.read_sql_query(query_5_7, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_4044\1965596796.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

             region  vacancies_count
0              Омск             21.0
1         Челябинск             22.0
2        Красноярск             23.0
3         Волгоград             24.0
4    Ростов-на-Дону             25.0
5            Казань             25.0
6             Пермь             25.0
7               Уфа             26.0
8            Самара             26.0
9         Краснодар             30.0
10          Воронеж             32.0
11      Новосибирск             35.0
12  Нижний Новгород             36.0
13     Екатеринбург             39.0
14  Санкт-Петербург             42.0
15           Москва             54.0
16            Total            485.0

***

In [ ]:
# выводы по анализу работодателей
По кол-ву вакансий в первой пятерки находятся такие компании как: Яндекс с 1933 вакансиями, Ростелеком 491 вакансия, Тинькофф 444, СБЕР 428 и Газпром нефть с 331 вакансиями. Также Яндекс и Ростелеком
охватывают 181 и 152 региона соответственно. У 8419 работодателей сфера деятельности не указана, а 3553 работодателей заняты в сфере Разработка программного обеспечения. Около 20% вакансий крупнейшего
работодателя Яндекс приходится на 16 городов России с населением боллее 1 млн. жителей.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [96]:
# Чтобы не учитывать регистр используем ILIKE
query_6_1 = f'''
    select
        count(v.name)
    FROM
        vacancies as v
    WHERE
        v.name ILIKE '%data%' OR v.name ILIKE '%данн%'
    '''

In [97]:
# результат запроса
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_4044\366702258.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [102]:
# В условиях сортировки зададим параметры для вакансий имеющих отнощение к дата-сайентистам AND вакансий начинающих специалистов
query_6_2 = f'''
    select
        count(v.name)
    FROM
        vacancies as v
    WHERE
        (v.name ILIKE '%data scientist%' OR
        v.name ILIKE '%data science%' OR
        v.name ILIKE '%исследователь данных%' OR
        (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%') OR
        v.name ILIKE '%machine learning%' OR
        v.name ILIKE '%машинн%обучен%') 
        AND
        (v.name ILIKE '%junior%' OR
        v.experience ILIKE '%Нет опыта%' OR
        v.employment ILIKE '%Стажировка%')
    '''

In [108]:
# результат запроса
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_4044\2267038862.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [105]:
# То же, что и в предыдущем запросе, но вместо вакансий начинающих специалистов, укажем ключевой навык SQL или postgres
query_6_3 = f'''
    select
        count(v.name)
    FROM
        vacancies as v
    WHERE
        (v.name ILIKE '%data scientist%' OR
        v.name ILIKE '%data science%' OR
        v.name ILIKE '%исследователь данных%' OR
        (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%') OR
        v.name ILIKE '%machine learning%' OR
        v.name ILIKE '%машинн%обучен%') 
        AND
        (v.key_skills ILIKE '%SQL%' OR
        v.key_skills ILIKE '%postgres%')
    '''

In [109]:
# результат запроса
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_4044\3794299702.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [116]:
# Аналогично предыдущему запросу, но теперь ключевой навык PYTHON
query_6_4 = f'''
    select
        count(v.name)
    FROM
        vacancies as v
    WHERE
        (v.name ILIKE '%data scientist%' OR
        v.name ILIKE '%data science%' OR
        v.name ILIKE '%исследователь данных%' OR
        (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%') OR
        v.name ILIKE '%machine learning%' OR
        v.name ILIKE '%машинн%обучен%') 
        AND
        (v.key_skills ILIKE '%Python%')
    '''

In [117]:
# результат запроса
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_4044\4264665179.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [119]:
# Из общей длины ключевых навыков отнимем длину ключевых навыков за минусом символа переноса строки, которым отделены навыки, +1(т.к например у 3 навыков будет 2 переноса). 
# Найдем среднее и округлим. Исключим пустые навыки
query_6_5 = f'''
    select
        round(avg(length(key_skills)
             -length(replace(key_skills, CHR(9), ''))+1), 2)
    FROM
        vacancies as v
    WHERE
        (v.name ILIKE '%data scientist%' OR
        v.name ILIKE '%data science%' OR
        v.name ILIKE '%исследователь данных%' OR
        (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%') OR
        v.name ILIKE '%machine learning%' OR
        v.name ILIKE '%машинн%обучен%') 
        AND
        (v.key_skills IS NOT NULL)
    '''

In [120]:
# результат запроса
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_4044\3654210517.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [122]:
# Функция coalesce возврощает ПЕРВОЕ значение отличное от NULL, поэтому сначала ищем сумму нижней и верхней планки з/п деленную на 2, потом нижнию планку, затем верхнюю. Берем среднее и округляем
# В условия отбора добавим опыт от 3 до 6 лет, и хотя бы 1 из полей з/п не NULL. Группировку произведем по опыту
query_6_6 = f'''
    select
        v.experience,
        round(avg(coalesce((v.salary_from + v.salary_to)/2, v.salary_from, v.salary_to)))
    FROM
        vacancies as v
    WHERE
        (v.name ILIKE '%data scientist%' OR
        v.name ILIKE '%data science%' OR
        v.name ILIKE '%исследователь данных%' OR
        (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%') OR
        v.name ILIKE '%machine learning%' OR
        v.name ILIKE '%машинн%обучен%') 
        AND
        v.experience = 'От 3 до 6 лет'
        AND
        (v.salary_from IS NOT NULL OR v.salary_to IS NOT NULL)
        GROUP BY v.experience
    '''

In [123]:
# результат запроса
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_4044\519194770.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

      experience     round
0  От 3 до 6 лет  243115.0

***

In [ ]:
# выводы по предметному анализу
В данном разделе мы анализировали вакансии связанные с дата-сайентистами и выяснили, что в базе есть 1771 вакансия имеющая отношение к данным. Для начинающих дата-сайентистов подойдет 51 вакансия.
В вакансиях связанных с данными в 201 требуется наличие ключевого навыка - умение работать с SQL или postgres. А в 351 вакансии требуется наличие ключевого навыка - язык Python. В среднем необходимо
владеть более чем 6 ключивыми навыками. Также мы выяснили, что у дата-сайентистов с опытом работы от 3-х до 6 лет средняя з/п составляет 243115 руб.

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования
Основная масса вакансий сосредаточена в крупных городах, соответственно в них проще всего найти работу. Самые востребованные вакансии: Системный администратор, Программист 1С, Бизнес-аналитик,
Специалист технической поддержки, Инженер-программист. Как видно все они так или иначе связаны с компьетерами. 
Также мы выяснили, что чем больше опыт работы, тем более высокая оплата труда предлагается.

In [40]:
query_7_1 = f'''
        SELECT 
    v.name as "Название вакансии",
    COUNT(distinct e.id) as "кол-во работодателей",
    COUNT(distinct v.id) as "кол-во вакансий"
FROM vacancies v
JOIN employers e ON v.employer_id = e.id
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10
'''

In [41]:
# результат запроса
df = pd.read_sql_query(query_7_1, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_29464\2931715827.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_7_1, connection)

                  Название вакансии  кол-во работодателей  кол-во вакансий
0           Системный администратор                  1457             1761
1                    Программист 1С                   850             1153
2                   Бизнес-аналитик                   392              488
3  Специалист технической поддержки                   339              457
4               Инженер-программист                   339              389
5                          Аналитик                   305              404
6                    Программист 1C                   281              360
7                Системный аналитик                   269              432
8                       Программист                   197              224
9              Frontend-разработчик                   183              242

In [75]:
query_7_2 = f'''
        SELECT 
    v.name as "Название вакансии",
    max(v.salary_from) as "з/п от",
    max(v.salary_to) as "з/п до",
    COUNT(distinct e.id) as "кол-во работодателей"
FROM vacancies v
JOIN employers e ON v.employer_id = e.id
WHERE v.salary_from is not NULL AND v.salary_to is not NULL
GROUP BY 1, v.salary_from, v.salary_to
ORDER BY 2 DESC
LIMIT 15
'''

In [76]:
# результат запроса
df = pd.read_sql_query(query_7_2, connection)
df

C:\Users\Андрей\AppData\Local\Temp\ipykernel_29464\746169716.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_7_2, connection)

,Название вакансии,з/п от,з/п до,кол-во работодателей
0,Frontend Developer in Unicorn Company,574000,860000,1
1,FullStack Developer in Unicorn Company,574000,860000,1
2,"Директор IT (HoReCa, Retail)",500000,600000,1
3,СТО/Директор по разработке,500000,1000000,1
4,Chief Product Officer (CPO),500000,600000,1
5,Брокер по продаже апартаментов,500000,1000000,1
6,Руководитель Отдела тестирования/QA,400000,600000,1
7,Product manager LATOKEN,400000,800000,1
8,QA Automation Engineer,400000,1000000,1
9,Lead of Mobile,400000,520000,1
10,Программист Java (переезд в г. Ташкент),360000,400000,1
11,Руководитель направления разработки,355000,520000,1
12,Senior DevOps Engineer,350691,526036,1
13,Blockchain Platform Developer (open source),350691,467588,1
14,Senior DevOps (Remote),350691,409140,1